app/controllers/languages_controller.rb

  def index
    @languages = Language.all
---
SELECT * FROM `languages`

  def update
    redirect_to languages_path if @language.update_attributes params[:language]
---
UPDATE `languages` SET `file_name` = 'lkdshgfksjdfh' WHERE `id` = 4

  def create
    @language = Language.new params[:language]
    redirect_to languages_path if @language.save
---
INSERT INTO `languages` (`name`, `file_name`) VALUES('Bosanski', '')

  def destroy
    redirect_to languages_path if @language.delete
---
DELETE FROM `languages` WHERE (`id` IN (3))

  def find_language
    @language = Language.find params[:id]
---
SELECT * FROM `languages` WHERE (`languages`.`id` = 3)